{
  "id": "BL-052",
  "title": "Contact Filtering, Selection & Campaign Management",
  "priority": "Must Have",
  "effort": "L",
  "status": "Spec'd",
  "sprint": "Sprint 3",
  "depends_on": [
    "AGENT",
    "PB-001"
  ],
  "spec": "## Contact Filtering, Selection & Campaign Management via Chat + UI\n\n### Goal\nEnable users to filter/select contacts and create or assign them to campaigns through BOTH the AI chat (as tool-use actions) and traditional UI (filter panel + table + modal).\n\n### Chat Tools\n- **filter_contacts**: Search contacts by tier, industry, seniority, department, region, score, enrichment status. Returns summary + top contacts.\n- **create_campaign**: Create a new campaign with name, description, strategy link.\n- **assign_to_campaign**: Add contacts (by IDs, company IDs, or filters) to a campaign. Handles dedup.\n- **check_strategy_conflicts**: Flag ICP mismatches, channel gaps, segment overlaps, timing/cooldown violations, tone mismatches.\n- **remove_from_campaign**: Remove contacts from draft/ready campaigns.\n\n### UI Components\n- **Filter Panel**: Faceted multi-value filters (company: tier, industry, size, region, revenue; contact: seniority, department, icp_fit, score range, language). Each filter shows counts.\n- **Contact Table**: Checkboxes, sort, virtual scroll, campaign badges for contacts already in campaigns.\n- **Add to Campaign Modal**: Select existing campaign or create new. Shows enrichment readiness and conflict check.\n- **Chat-UI Sync**: AI filters populate UI panel; UI selections available to AI.\n\n### API Endpoints\n- `POST /api/contacts/search` — Advanced paginated search with facets (for UI and AI)\n- `POST /api/contacts/search/summary` — Aggregate stats without records (for AI)\n- `POST /api/campaigns/{id}/conflict-check` — Strategy conflict analysis\n- Migration: `strategy_id`, `target_criteria`, `conflict_report`, `contact_cooldown_days` on campaigns; `campaign_overlap_log` audit table\n\n### Data Model Changes\n- Campaigns: add strategy_id (FK), target_criteria (JSONB), conflict_report (JSONB), contact_cooldown_days (INT)\n- New table: campaign_overlap_log (audit trail for overlap decisions)\n- No changes to contacts or messages tables\n\n### Conflict Detection (5 types)\n1. **ICP Mismatch**: Company attributes vs strategy ICP definition\n2. **Channel Gap**: Missing email/LinkedIn for campaign's configured channels\n3. **Segment Overlap**: Contact in other active/approved campaigns\n4. **Cooldown Violation**: Recently contacted (configurable per-channel cooldown)\n5. **Tone Mismatch**: Campaign tone vs contact relationship status\n\n### Acceptance Criteria\n- Given a user asks the AI to find contacts, the AI calls filter_contacts and returns a summary with top contacts and offers to create a campaign\n- Given no contacts match, the AI suggests relaxing criteria with alternatives\n- Given a user says 'create a campaign with those contacts', the AI creates the campaign and assigns contacts in one turn\n- Given contacts overlap with another campaign, the AI flags the overlap with campaign names and status\n- Given the UI filter panel is used, faceted counts update in real-time as filters change\n- Given 15 contacts are selected in the UI, clicking 'Add to Campaign' opens a modal with existing/new campaign options\n- Given the AI filters contacts, the UI filter panel can sync to show the same results",
  "description": "Users can filter/select contacts and create or assign them to campaigns through BOTH AI chat tools and traditional UI. Chat tools: `filter_contacts`, `create_campaign`, `assign_to_campaign`, `check_strategy_conflicts`. UI: faceted filter panel, contact table with checkboxes, campaign creation modal. AI proactively flags ALL strategy conflicts: ICP mismatch, channel gaps, segment overlap with active campaigns, timing/cooldown violations, and tone mismatches. Campaigns become internal (no Lemlist dependency). Strategy document links to campaigns for ICP-aware conflict detection.",
  "created": "2026-02-23",
  "updated": "2026-02-23",
  "theme": "Outreach Engine",
  "spec_file": "docs/specs/contact-campaign-management.md"
}